# создаю базовый образ Node.js 20й версии (та же, что и у меня) на базе Alpine Linux
FROM node:20-alpine


# задаю рабочую директорию
WORKDIR /app

# копирую package.json отдельно, что бы он не перезаписывался лишний раз 
COPY package*.json ./

# устанавливаю зависимости через lock файл для надежности
RUN npm ci 


# копирую все файлы из проэкта в контейнер
COPY . .

# собираю prod версию приложения
RUN npm run build

# указываю порт 3000 для работы next.js
EXPOSE 3000

# указываю порт 4000 для работы сервера
EXPOSE 4000


# указываю команду для запуска готового приложения
CMD ["npm", "run", "start"]

